## ✅ Terraform Apply: Dev

Successfully applied infrastructure changes to **dev** environment!

<details>
<summary>📋 Apply Output (click to expand)</summary>

```terraform
time=2025-12-11T06:21:57Z level=info msg=The stack at /home/runner/work/interview/interview/sre/terragrunt/environments/dev will be processed in the following order for command apply:
Group 1
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking

Group 2
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks

Group 3
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/iam


time=2025-12-11T06:21:57Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/networking into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking/.terragrunt-cache/U5oswpjzT80__bq6z5CjLFPgEhE/oe-HFdXMekaLtOb26xJTuUQbvwc prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking] 

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=us-east-1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_cloudwatch_log_group.flow_logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "flow_logs" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/vpc/tekmetric-dev"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-flow-logs"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-flow-logs"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_eip.nat[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eip" "nat" {
      [32m+[0m[0m allocation_id        = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m association_id       = (known after apply)
      [32m+[0m[0m carrier_ip           = (known after apply)
      [32m+[0m[0m customer_owned_ip    = (known after apply)
      [32m+[0m[0m domain               = "vpc"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m instance             = (known after apply)
      [32m+[0m[0m ipam_pool_id         = (known after apply)
      [32m+[0m[0m network_border_group = (known after apply)
      [32m+[0m[0m network_interface    = (known after apply)
      [32m+[0m[0m private_dns          = (known after apply)
      [32m+[0m[0m private_ip           = (known after apply)
      [32m+[0m[0m ptr_record           = (known after apply)
      [32m+[0m[0m public_dns           = (known after apply)
      [32m+[0m[0m public_ip            = (known after apply)
      [32m+[0m[0m public_ipv4_pool     = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-nat-eip-1"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-nat-eip-1"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m vpc                  = (known after apply)
    }

[1m  # aws_flow_log.main[0][0m will be created
[0m  [32m+[0m[0m resource "aws_flow_log" "main" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m iam_role_arn             = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m log_destination          = (known after apply)
      [32m+[0m[0m log_destination_type     = "cloud-watch-logs"
      [32m+[0m[0m log_format               = (known after apply)
      [32m+[0m[0m log_group_name           = (known after apply)
      [32m+[0m[0m max_aggregation_interval = 600
      [32m+[0m[0m tags                     = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-flow-logs"
        }
      [32m+[0m[0m tags_all                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-flow-logs"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m traffic_type             = "ALL"
      [32m+[0m[0m vpc_id                   = (known after apply)
    }

[1m  # aws_iam_role.flow_logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "flow_logs" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "tekmetric-dev-vpc-flow-logs"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role_policy.flow_logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "flow_logs" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "tekmetric-dev-vpc-flow-logs"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "logs:CreateLogGroup",
                          [32m+[0m[0m "logs:CreateLogStream",
                          [32m+[0m[0m "logs:PutLogEvents",
                          [32m+[0m[0m "logs:DescribeLogGroups",
                          [32m+[0m[0m "logs:DescribeLogStreams",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m role        = (known after apply)
    }

[1m  # aws_internet_gateway.main[0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "main" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-igw"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-igw"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # aws_nat_gateway.main[0][0m will be created
[0m  [32m+[0m[0m resource "aws_nat_gateway" "main" {
      [32m+[0m[0m allocation_id                      = (known after apply)
      [32m+[0m[0m association_id                     = (known after apply)
      [32m+[0m[0m connectivity_type                  = "public"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m network_interface_id               = (known after apply)
      [32m+[0m[0m private_ip                         = (known after apply)
      [32m+[0m[0m public_ip                          = (known after apply)
      [32m+[0m[0m secondary_private_ip_address_count = (known after apply)
      [32m+[0m[0m secondary_private_ip_addresses     = (known after apply)
      [32m+[0m[0m subnet_id                          = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-nat-1"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-nat-1"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_route.private_nat[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route" "private_nat" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m nat_gateway_id         = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)
    }

[1m  # aws_route_table.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-private-rt-1"
          [32m+[0m[0m "Type"        = "private"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-private-rt-1"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
          [32m+[0m[0m "Type"        = "private"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # aws_route_table.public[0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = [
          [32m+[0m[0m {
              [32m+[0m[0m carrier_gateway_id         = ""
              [32m+[0m[0m cidr_block                 = "0.0.0.0/0"
              [32m+[0m[0m core_network_arn           = ""
              [32m+[0m[0m destination_prefix_list_id = ""
              [32m+[0m[0m egress_only_gateway_id     = ""
              [32m+[0m[0m gateway_id                 = (known after apply)
              [32m+[0m[0m ipv6_cidr_block            = ""
              [32m+[0m[0m local_gateway_id           = ""
              [32m+[0m[0m nat_gateway_id             = ""
              [32m+[0m[0m network_interface_id       = ""
              [32m+[0m[0m transit_gateway_id         = ""
              [32m+[0m[0m vpc_endpoint_id            = ""
              [32m+[0m[0m vpc_peering_connection_id  = ""
            },
        ]
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-public-rt"
          [32m+[0m[0m "Type"        = "public"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-public-rt"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
          [32m+[0m[0m "Type"        = "public"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # aws_route_table_association.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_route_table_association.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_route_table_association.private[2][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_route_table_association.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_route_table_association.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_route_table_association.public[2][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # aws_security_group.eks_cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "eks_cluster" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for EKS cluster control plane"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = "tekmetric-dev-eks-cluster-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-eks-cluster-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-eks-cluster-sg"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # aws_security_group.eks_nodes[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "eks_nodes" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for EKS worker nodes"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = "tekmetric-dev-eks-nodes-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment"                         = "dev"
          [32m+[0m[0m "ManagedBy"                           = "Terraform"
          [32m+[0m[0m "Module"                              = "networking"
          [32m+[0m[0m "Name"                                = "tekmetric-dev-eks-nodes-sg"
          [32m+[0m[0m "kubernetes.io/cluster/tekmetric-dev" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment"                         = "dev"
          [32m+[0m[0m "ManagedBy"                           = "Terraform"
          [32m+[0m[0m "Module"                              = "networking"
          [32m+[0m[0m "Name"                                = "tekmetric-dev-eks-nodes-sg"
          [32m+[0m[0m "Project"                             = "tekmetric"
          [32m+[0m[0m "Repository"                          = "interview"
          [32m+[0m[0m "kubernetes.io/cluster/tekmetric-dev" = "owned"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # aws_security_group.vpc_endpoints[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "vpc_endpoints" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for VPC endpoints"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "Allow all outbound"
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "10.0.0.0/16",
                ]
              [32m+[0m[0m description      = "HTTPS from VPC"
              [32m+[0m[0m from_port        = 443
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 443
            },
        ]
      [32m+[0m[0m name                   = "tekmetric-dev-vpc-endpoints-sg"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-endpoints-sg"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc-endpoints-sg"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # aws_security_group_rule.cluster_egress_all[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "cluster_egress_all" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all outbound traffic"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # aws_security_group_rule.cluster_ingress_nodes[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "cluster_ingress_nodes" {
      [32m+[0m[0m description              = "Allow nodes to communicate with the cluster API server"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # aws_security_group_rule.nodes_cluster_ingress[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "nodes_cluster_ingress" {
      [32m+[0m[0m description              = "Allow worker Kubelets and pods to receive communication from the cluster control plane"
      [32m+[0m[0m from_port                = 1025
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 65535
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # aws_security_group_rule.nodes_egress_all[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "nodes_egress_all" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all outbound traffic"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # aws_security_group_rule.nodes_internal[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "nodes_internal" {
      [32m+[0m[0m description              = "Allow nodes to communicate with each other"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 65535
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # aws_subnet.private[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment"                     = "dev"
          [32m+[0m[0m "ManagedBy"                       = "Terraform"
          [32m+[0m[0m "Module"                          = "networking"
          [32m+[0m[0m "Name"                            = "tekmetric-dev-private-us-east-1a"
          [32m+[0m[0m "Type"                            = "private"
          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment"                     = "dev"
          [32m+[0m[0m "ManagedBy"                       = "Terraform"
          [32m+[0m[0m "Module"                          = "networking"
          [32m+[0m[0m "Name"                            = "tekmetric-dev-private-us-east-1a"
          [32m+[0m[0m "Project"                         = "tekmetric"
          [32m+[0m[0m "Repository"                      = "interview"
          [32m+[0m[0m "Type"                            = "private"
          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.private[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.2.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment"                     = "dev"
          [32m+[0m[0m "ManagedBy"                       = "Terraform"
          [32m+[0m[0m "Module"                          = "networking"
          [32m+[0m[0m "Name"                            = "tekmetric-dev-private-us-east-1b"
          [32m+[0m[0m "Type"                            = "private"
          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment"                     = "dev"
          [32m+[0m[0m "ManagedBy"                       = "Terraform"
          [32m+[0m[0m "Module"                          = "networking"
          [32m+[0m[0m "Name"                            = "tekmetric-dev-private-us-east-1b"
          [32m+[0m[0m "Project"                         = "tekmetric"
          [32m+[0m[0m "Repository"                      = "interview"
          [32m+[0m[0m "Type"                            = "private"
          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.private[2][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.3.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment"                     = "dev"
          [32m+[0m[0m "ManagedBy"                       = "Terraform"
          [32m+[0m[0m "Module"                          = "networking"
          [32m+[0m[0m "Name"                            = "tekmetric-dev-private-us-east-1c"
          [32m+[0m[0m "Type"                            = "private"
          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment"                     = "dev"
          [32m+[0m[0m "ManagedBy"                       = "Terraform"
          [32m+[0m[0m "Module"                          = "networking"
          [32m+[0m[0m "Name"                            = "tekmetric-dev-private-us-east-1c"
          [32m+[0m[0m "Project"                         = "tekmetric"
          [32m+[0m[0m "Repository"                      = "interview"
          [32m+[0m[0m "Type"                            = "private"
          [32m+[0m[0m "kubernetes.io/role/internal-elb" = "1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.101.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment"            = "dev"
          [32m+[0m[0m "ManagedBy"              = "Terraform"
          [32m+[0m[0m "Module"                 = "networking"
          [32m+[0m[0m "Name"                   = "tekmetric-dev-public-us-east-1a"
          [32m+[0m[0m "Type"                   = "public"
          [32m+[0m[0m "kubernetes.io/role/elb" = "1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment"            = "dev"
          [32m+[0m[0m "ManagedBy"              = "Terraform"
          [32m+[0m[0m "Module"                 = "networking"
          [32m+[0m[0m "Name"                   = "tekmetric-dev-public-us-east-1a"
          [32m+[0m[0m "Project"                = "tekmetric"
          [32m+[0m[0m "Repository"             = "interview"
          [32m+[0m[0m "Type"                   = "public"
          [32m+[0m[0m "kubernetes.io/role/elb" = "1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.public[1][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1b"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.102.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment"            = "dev"
          [32m+[0m[0m "ManagedBy"              = "Terraform"
          [32m+[0m[0m "Module"                 = "networking"
          [32m+[0m[0m "Name"                   = "tekmetric-dev-public-us-east-1b"
          [32m+[0m[0m "Type"                   = "public"
          [32m+[0m[0m "kubernetes.io/role/elb" = "1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment"            = "dev"
          [32m+[0m[0m "ManagedBy"              = "Terraform"
          [32m+[0m[0m "Module"                 = "networking"
          [32m+[0m[0m "Name"                   = "tekmetric-dev-public-us-east-1b"
          [32m+[0m[0m "Project"                = "tekmetric"
          [32m+[0m[0m "Repository"             = "interview"
          [32m+[0m[0m "Type"                   = "public"
          [32m+[0m[0m "kubernetes.io/role/elb" = "1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_subnet.public[2][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "us-east-1c"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.103.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = true
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment"            = "dev"
          [32m+[0m[0m "ManagedBy"              = "Terraform"
          [32m+[0m[0m "Module"                 = "networking"
          [32m+[0m[0m "Name"                   = "tekmetric-dev-public-us-east-1c"
          [32m+[0m[0m "Type"                   = "public"
          [32m+[0m[0m "kubernetes.io/role/elb" = "1"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment"            = "dev"
          [32m+[0m[0m "ManagedBy"              = "Terraform"
          [32m+[0m[0m "Module"                 = "networking"
          [32m+[0m[0m "Name"                   = "tekmetric-dev-public-us-east-1c"
          [32m+[0m[0m "Project"                = "tekmetric"
          [32m+[0m[0m "Repository"             = "interview"
          [32m+[0m[0m "Type"                   = "public"
          [32m+[0m[0m "kubernetes.io/role/elb" = "1"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # aws_vpc.main[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "main" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-vpc"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
    }

[1m  # aws_vpc_endpoint.ecr_api[0][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc_endpoint" "ecr_api" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m cidr_blocks           = (known after apply)
      [32m+[0m[0m dns_entry             = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m ip_address_type       = (known after apply)
      [32m+[0m[0m network_interface_ids = (known after apply)
      [32m+[0m[0m owner_id              = (known after apply)
      [32m+[0m[0m policy                = (known after apply)
      [32m+[0m[0m prefix_list_id        = (known after apply)
      [32m+[0m[0m private_dns_enabled   = true
      [32m+[0m[0m requester_managed     = (known after apply)
      [32m+[0m[0m route_table_ids       = (known after apply)
      [32m+[0m[0m security_group_ids    = (known after apply)
      [32m+[0m[0m service_name          = "com.amazonaws.us-east-1.ecr.api"
      [32m+[0m[0m service_region        = (known after apply)
      [32m+[0m[0m state                 = (known after apply)
      [32m+[0m[0m subnet_ids            = (known after apply)
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-ecr-api-endpoint"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-ecr-api-endpoint"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m vpc_endpoint_type     = "Interface"
      [32m+[0m[0m vpc_id                = (known after apply)
    }

[1m  # aws_vpc_endpoint.ecr_dkr[0][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc_endpoint" "ecr_dkr" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m cidr_blocks           = (known after apply)
      [32m+[0m[0m dns_entry             = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m ip_address_type       = (known after apply)
      [32m+[0m[0m network_interface_ids = (known after apply)
      [32m+[0m[0m owner_id              = (known after apply)
      [32m+[0m[0m policy                = (known after apply)
      [32m+[0m[0m prefix_list_id        = (known after apply)
      [32m+[0m[0m private_dns_enabled   = true
      [32m+[0m[0m requester_managed     = (known after apply)
      [32m+[0m[0m route_table_ids       = (known after apply)
      [32m+[0m[0m security_group_ids    = (known after apply)
      [32m+[0m[0m service_name          = "com.amazonaws.us-east-1.ecr.dkr"
      [32m+[0m[0m service_region        = (known after apply)
      [32m+[0m[0m state                 = (known after apply)
      [32m+[0m[0m subnet_ids            = (known after apply)
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-ecr-dkr-endpoint"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-ecr-dkr-endpoint"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m vpc_endpoint_type     = "Interface"
      [32m+[0m[0m vpc_id                = (known after apply)
    }

[1m  # aws_vpc_endpoint.s3[0][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc_endpoint" "s3" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m cidr_blocks           = (known after apply)
      [32m+[0m[0m dns_entry             = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m ip_address_type       = (known after apply)
      [32m+[0m[0m network_interface_ids = (known after apply)
      [32m+[0m[0m owner_id              = (known after apply)
      [32m+[0m[0m policy                = (known after apply)
      [32m+[0m[0m prefix_list_id        = (known after apply)
      [32m+[0m[0m private_dns_enabled   = (known after apply)
      [32m+[0m[0m requester_managed     = (known after apply)
      [32m+[0m[0m route_table_ids       = (known after apply)
      [32m+[0m[0m security_group_ids    = (known after apply)
      [32m+[0m[0m service_name          = "com.amazonaws.us-east-1.s3"
      [32m+[0m[0m service_region        = (known after apply)
      [32m+[0m[0m state                 = (known after apply)
      [32m+[0m[0m subnet_ids            = (known after apply)
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-s3-endpoint"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Module"      = "networking"
          [32m+[0m[0m "Name"        = "tekmetric-dev-s3-endpoint"
          [32m+[0m[0m "Project"     = "tekmetric"
          [32m+[0m[0m "Repository"  = "interview"
        }
      [32m+[0m[0m vpc_endpoint_type     = "Gateway"
      [32m+[0m[0m vpc_id                = (known after apply)
    }

[1mPlan:[0m 34 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m availability_zones              = [
      [32m+[0m[0m "us-east-1a",
      [32m+[0m[0m "us-east-1b",
      [32m+[0m[0m "us-east-1c",
    ]
  [32m+[0m[0m ecr_api_vpc_endpoint_id         = (known after apply)
  [32m+[0m[0m ecr_dkr_vpc_endpoint_id         = (known after apply)
  [32m+[0m[0m eks_cluster_security_group_id   = (known after apply)
  [32m+[0m[0m eks_nodes_security_group_id     = (known after apply)
  [32m+[0m[0m flow_logs_iam_role_arn          = (known after apply)
  [32m+[0m[0m flow_logs_log_group_name        = "/aws/vpc/tekmetric-dev"
  [32m+[0m[0m internet_gateway_id             = (known after apply)
  [32m+[0m[0m nat_gateway_ids                 = [
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m nat_gateway_ips                 = [
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m private_subnet_cidrs            = [
      [32m+[0m[0m "10.0.1.0/24",
      [32m+[0m[0m "10.0.2.0/24",
      [32m+[0m[0m "10.0.3.0/24",
    ]
  [32m+[0m[0m private_subnet_ids              = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m public_subnet_cidrs             = [
      [32m+[0m[0m "10.0.101.0/24",
      [32m+[0m[0m "10.0.102.0/24",
      [32m+[0m[0m "10.0.103.0/24",
    ]
  [32m+[0m[0m public_subnet_ids               = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m s3_vpc_endpoint_id              = (known after apply)
  [32m+[0m[0m vpc_arn                         = (known after apply)
  [32m+[0m[0m vpc_cidr                        = "10.0.0.0/16"
  [32m+[0m[0m vpc_endpoints_security_group_id = (known after apply)
  [32m+[0m[0m vpc_id                          = (known after apply)
[0m[1maws_cloudwatch_log_group.flow_logs[0]: Creating...[0m[0m
[0m[1maws_iam_role.flow_logs[0]: Creating...[0m[0m
[0m[1maws_vpc.main: Creating...[0m[0m
[0m[1maws_iam_role.flow_logs[0]: Creation complete after 0s [id=tekmetric-dev-vpc-flow-logs][0m
[0m[1maws_iam_role_policy.flow_logs[0]: Creating...[0m[0m
[0m[1maws_iam_role_policy.flow_logs[0]: Creation complete after 0s [id=tekmetric-dev-vpc-flow-logs:tekmetric-dev-vpc-flow-logs][0m
[0m[1maws_vpc.main: Still creating... [10s elapsed][0m[0m
[0m[1maws_vpc.main: Creation complete after 11s [id=vpc-0d04b029b1b41d9cb][0m
[0m[1maws_security_group.eks_cluster: Creating...[0m[0m
[0m[1maws_subnet.public[0]: Creating...[0m[0m
[0m[1maws_security_group.vpc_endpoints[0]: Creating...[0m[0m
[0m[1maws_subnet.private[1]: Creating...[0m[0m
[0m[1maws_subnet.public[2]: Creating...[0m[0m
[0m[1maws_security_group.eks_nodes: Creating...[0m[0m
[0m[1maws_route_table.private[0]: Creating...[0m[0m
[0m[1maws_subnet.private[2]: Creating...[0m[0m
[0m[1maws_internet_gateway.main: Creating...[0m[0m
[0m[1maws_subnet.public[1]: Creating...[0m[0m
[0m[1maws_internet_gateway.main: Creation complete after 0s [id=igw-05a0f602e1a292fa6][0m
[0m[1maws_subnet.private[0]: Creating...[0m[0m
[0m[1maws_route_table.private[0]: Creation complete after 0s [id=rtb-0c54cbca0a7bfda1f][0m
[0m[1maws_eip.nat[0]: Creating...[0m[0m
[0m[1maws_subnet.private[1]: Creation complete after 1s [id=subnet-00dbf7d2f282bd8e8][0m
[0m[1maws_route_table.public: Creating...[0m[0m
[0m[1maws_subnet.private[0]: Creation complete after 1s [id=subnet-06bf920171fe89995][0m
[0m[1maws_eip.nat[0]: Creation complete after 1s [id=eipalloc-0d1602a3d7d8b0606][0m
[0m[1maws_security_group.eks_nodes: Creation complete after 1s [id=sg-02a5e423f48498206][0m
[0m[1maws_security_group_rule.nodes_internal: Creating...[0m[0m
[0m[1maws_security_group_rule.nodes_egress_all: Creating...[0m[0m
[0m[1maws_route_table.public: Creation complete after 1s [id=rtb-00eca126695b9ed27][0m
[0m[1maws_vpc_endpoint.s3[0]: Creating...[0m[0m
[0m[1maws_security_group.eks_cluster: Creation complete after 2s [id=sg-0765c3c9e589fcacb][0m
[0m[1maws_security_group_rule.cluster_egress_all: Creating...[0m[0m
[0m[1maws_security_group_rule.nodes_cluster_ingress: Creating...[0m[0m
[0m[1maws_security_group_rule.nodes_egress_all: Creation complete after 1s [id=sgrule-2888579415][0m
[0m[1maws_security_group_rule.cluster_ingress_nodes: Creating...[0m[0m
[0m[1maws_security_group_rule.cluster_egress_all: Creation complete after 1s [id=sgrule-3689166583][0m
[0m[1maws_security_group.vpc_endpoints[0]: Creation complete after 3s [id=sg-017b3aafe4ab9ff8c][0m
[0m[1maws_security_group_rule.nodes_internal: Creation complete after 2s [id=sgrule-4018266962][0m
[0m[1maws_security_group_rule.cluster_ingress_nodes: Creation complete after 1s [id=sgrule-1226855061][0m
[0m[1maws_security_group_rule.nodes_cluster_ingress: Creation complete after 2s [id=sgrule-1131251195][0m
[0m[1maws_subnet.private[2]: Creation complete after 3s [id=subnet-0fb7d3622002c53e2][0m
[0m[1maws_route_table_association.private[1]: Creating...[0m[0m
[0m[1maws_route_table_association.private[0]: Creating...[0m[0m
[0m[1maws_route_table_association.private[2]: Creating...[0m[0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Creating...[0m[0m
[0m[1maws_vpc_endpoint.ecr_dkr[0]: Creating...[0m[0m
[0m[1maws_route_table_association.private[2]: Creation complete after 1s [id=rtbassoc-081f1e1fead958ed9][0m
[0m[1maws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-040acfb81901f32a0][0m
[0m[1maws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-07de275c2e85a61a5][0m
[0m[1maws_vpc_endpoint.s3[0]: Creation complete after 6s [id=vpce-03ca51fb60b18e0bc][0m
[0m[1maws_subnet.public[0]: Still creating... [11s elapsed][0m[0m
[0m[1maws_subnet.public[2]: Still creating... [10s elapsed][0m[0m
[0m[1maws_subnet.public[1]: Still creating... [10s elapsed][0m[0m
[0m[1maws_subnet.public[1]: Creation complete after 11s [id=subnet-0fc90bfcb34adb977][0m
[0m[1maws_subnet.public[2]: Creation complete after 12s [id=subnet-0b1a3fff2e7c83216][0m
[0m[1maws_vpc_endpoint.ecr_dkr[0]: Still creating... [10s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Still creating... [10s elapsed][0m[0m
[0m[1maws_subnet.public[0]: Creation complete after 15s [id=subnet-0a4b6e8eb468fabe3][0m
[0m[1maws_route_table_association.public[2]: Creating...[0m[0m
[0m[1maws_route_table_association.public[0]: Creating...[0m[0m
[0m[1maws_nat_gateway.main[0]: Creating...[0m[0m
[0m[1maws_route_table_association.public[1]: Creating...[0m[0m
[0m[1maws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-091af620561aab94d][0m
[0m[1maws_route_table_association.public[2]: Creation complete after 1s [id=rtbassoc-087fd1cc7e9a2cba2][0m
[0m[1maws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-023617a38ade74649][0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Still creating... [20s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_dkr[0]: Still creating... [20s elapsed][0m[0m
[0m[1maws_nat_gateway.main[0]: Still creating... [10s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_dkr[0]: Still creating... [30s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Still creating... [30s elapsed][0m[0m
[0m[1maws_nat_gateway.main[0]: Still creating... [20s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Still creating... [40s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_dkr[0]: Still creating... [40s elapsed][0m[0m
[0m[1maws_nat_gateway.main[0]: Still creating... [30s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_dkr[0]: Creation complete after 43s [id=vpce-0f4f9e0a165ff9af3][0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Still creating... [50s elapsed][0m[0m
[0m[1maws_nat_gateway.main[0]: Still creating... [40s elapsed][0m[0m
[0m[1maws_vpc_endpoint.ecr_api[0]: Creation compl

... (truncated)

See full output in job logs.
```

</details>

**Resources:**
- [EKS Console](https://console.aws.amazon.com/eks/home?region=us-east-1#/clusters/tekmetric-dev)
- [Full logs](https://github.com/actekmetric/interview/actions/runs/20123969298)
